
import { ItemsProps } from "../../types/step";


export const STEP_ITEM: ItemsProps[] = 
[
{
    "number": 1,
    "title": "Маркетинговый анализ бизнеса",
    "path": "01marcketing",
    "img": "./assets/Frame1.png",
    "textFirst": "На предварительном этапе мы выясняем специфику вашего бизнеса, товаров. Отмечаем ваши преимущества и уникальные предложения, изучаем ожидания и потребности целевой аудитории, рассматриваем ближайшее конкурентное окружение.",
    "textSecond": "На основании полученных данных мы разрабатываем прототип интернет-магазина, пишем техническое ТЗ для специалистов, готовим рекомендации по текстовому наполнению с учетом требований SEO, разрабатываем план по внешней и внутренней оптимизации сайта. Также мы создаем набор готовых элементов для пользовательского интерфейса."
},
{
    "number": 2,
    "title": "Привлекательный дизайн",
    "path": "02Disigne",
    "img": "./assets/Frame2.png",
    "textFirst": "Интерфейс сайта будет соответствовать современным требованиям и отвечать ожиданиям целевой аудитории. Опытные специалисты Millenium создадут UX-дизайн, отталкиваясь от данных анализа пользовательского поведения, что позволит в несколько раз увеличить конверсию.",
    "textSecond": "Мы подберем оптимальные цветовые сочетания (основной, дополнительные, акцентные цвета), уделим внимание четкости графики, наглядности интерфейса, понятной и лаконичной визуализации."
},
{
    "number": 3,
    "title": "Профессиональная верстка",
    "path": "03Verstka",
    "img": "./assets/Frame3.png",
    "textFirst": "Мы производим верстку по стандарту Pixel Perfect, который предполагает точное соответствие сверстанных страниц дизайн-макету. Наши специалисты напишут чистый код с двухфакторной проверкой, позволяющий обеспечить высокую скорость загрузки на любых браузерах и электронных устройствах (десктопных и мобильных).",
    "textSecond": "Профессиональная адаптивная верстка является важным условием бесперебойной надежной работы сайта на протяжении длительного времени. "
},
{
    "number": 4,
    "title": "«Посадка» на CMS",
    "path": "04CMS",
    "img": "./assets/Frame4.png",
    "textFirst": "Невозможно представить интернет-магазин без системы управления сайтом. Специалисты Millenium выполнят посадку готовой верстки вашего магазина на CMS №1 в странах СНГ - 1с Битрикс. ",
    "textSecond": "Благодаря CMS, вы просто заходите в административную панель, и, при помощи понятных полей, легко управляете содержимым — редактируете новости, вносите коррективы в товары, добавляет фото и видеоконтент, модерируете и выполняете множество других действий, которые без CMS были бы сущим кошмаром."
},
{
    "number": 5,
    "title": "Тестирование и доработка",
    "path": "05Testing",
    "img": "",
    "textFirst": "Чтобы избежать проблем во время использования сайта, на данном этапе мы отрабатываем все возможные сценарии взаимодействия пользователей с сайтом. Это позволяет вовремя выявить ошибки и устранить их. Мы тестируем usability и безопасность сайта, проверяем скорость загрузки страниц, работу форм обратной связи и интерактивных элементов, отображение страниц на разных устройствах. Это позволяет на 100% гарантировать функциональность ресурса.",
},
{
    "number": 6,
    "title": "Запуск сайта",
    "path": "06Start",
    "img": "",
    "textFirst": "Когда все проверено и выполнены все нужные доработки, остается лишь выполнить грамотный запуск сайта. Наши специалисты сверяют всё по чек-листу, чтобы избежать неприятностей и получить на выходе идеальный интернет-магазин с высокой конверсией. Сайт от профессионалов Millenium позволит вам легко привлекать новых клиентов и станет достойным лицом вашей компании в интернете.",
},
];